---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsAttrStairCalculator
source: html/e1a9182b-2c0c-17a7-1152-150c25e46217.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsAttrStairCalculator Property

"Calculation Rules"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsAttrStairCalculator { get; }
```